# CannotCopyTag Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TagFailures..::..CannotCopyTag Property
BuiltInFailures..::..TagFailures Class See Also
---
A tag cannot be arrayed without copying the associated element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyTag { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyTag As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyTag {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TagFailures Class
Autodesk.Revit.DB Namespace